<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>운동하는 개발자 | 프로필</title>
	<!-- css -->
	<link href="${pageContext.request.contextPath}/resources/css/index.css" rel="stylesheet" type="text/css">
	
	<!-- icon -->
	<link rel="shortcut icon" type="image⁄x-icon" href="${pageContext.request.contextPath}/resources/images/stepIcon.png">
</head>
<body>

	<!-- NAV -->
	<%@ include file="include/nav.jsp" %>
	
	<!-- main -->
	<div id="wrap">
		<section id="content">
			<div id="intro">
				<div id="introtitle">
					<h2>함께 달리고 싶은 열정 지원자, 최진우입니다.</h2>
				</div>
				<div id="introinfo">
					<div id="imginfo">
						<img src=""/>
					</div>
					<div id="myinfo">
						<h4>최진우</h4>
						<p>1996.07.03</p>
						<p>010-7713-9233</p>
						<p>서울 서대문구 증가로</p>
						<table>
							<thead>
								<tr>
									<th>학력사항</th>
									<th>경력사항</th>
								</tr>
							</thead>
							<tbody>
								<tr>
									<td>
										전문대졸(3년제)<br>
										유한대학교
									</td>
									<td>
										신입
									</td>
								</tr>
							</tbody>
						</table>
						<br><br><br>
					</div>
				</div>
				<div id="gradeinfo">
					<br><br>
					<sapn style="font-size: 22px;font-weight: bold;">학력</sapn>   최종학력  |  대학교 2,3년제 졸업
					<table>
						<thead>
							<tr>
								<th>재학기간</th>
								<th>구분</th>
								<th>학교명</th>
								<th>전공</th>
								<th>학점</th>
							</tr>
						</thead>
						<tbody>
							<tr>
								<td>2016.02 ~ 2021.02</td>
								<td>졸업</td>
								<td>유한대학교</td>
								<td>IT소프트웨어공학과</td>
								<td>3.91 / 4.5</td>
							</tr>
						</tbody>
					</table>
				</div>
				<div id="careerinfo">
					<br><br>
					<sapn style="font-size: 22px;font-weight: bold;">경력</sapn><br>
				</div>
				<div id="plusinfo">
					<br><br>
					<sapn style="font-size: 22px;font-weight: bold;">취업우대사항</sapn><br>
					<span style="font-weight: bold;">병역대상</span>      군필  |  2017.02 ~ 2018.11  |  육군  |  병장  |  만기제대
				</div>
				<div id="introduce">
					<br><br>
					<span style="font-size: 22px; font-weight: bold;">자기소개서</span><br>
					<div id="introducemyself">
						<h4>[최고의 기업에 최고의 인재가 되겠습니다]</h4>
						<span>
							저는 사람과의 관계가 중요하다 생각하고 살아와서, 다방면으로 많고 좋은 친구들을 만나고, 만들어 왔습니다.<br>
							현재도 사람이 가장 중요하다고 생각하여 한 사람 한 사람에게 최선을 다하고 있습니다.<br>
							자신에게 부끄럽지 않고, 자랑스러운 사회인이 되기 위해, 대학에서 자신의 계발에 많은 시간을 할애했습니다.<br>
							관심 있는 분야에 더 많은 시간을 할애하고, 실력을 쌓아보고 싶어 하여 많은 시행착오를 거치며 공부해왔습니다.<br>
							많은 시행착오를 겪었지만 만족하지 못하여 거기에 머무르지 않고, 그것을 통해서 새로운 경험과 개선점을 찾으려는 노력을 게을리하지 않았습니다.<br>
							<br>
							제 성격에 대해 한마디로 설명하면 `완벽하지 않으면 만족하지 못한다`라는 것입니다. 사소한 것 하나부터 내가 한 번 기획한 일에 대해서는 절대 대충하지 않습니다.<br>
							그렇다고 무턱대고 실현성 없는 걸 하지는 않습니다. 어떤 기획이 있을 때 일단 저질러 놓고 사태를 수습하는 스타일보다는 구상을 대충 먼저 짜는 편입니다.<br>
							자신을 싫어하는 사람이 있으면 그 사람에게 더 잘 보이고 싶어 노력하는 성격입니다.<br>
							호기심이 많아 모르는 부분을 이해하려고 끝까지 붙잡고 공부합니다.<br>
							성격은 차분하고 사교적이고, 인물형은 지도자형이라기보다는 참모형입니다.<br>
							제가 생각하는 장점이자 단점은 아주 완벽을 추구하여 자신이 만족할 때까지 하는 것입니다.<br>
							<br>
							저는 대학에 들어와 컴퓨터 언어라는 것에 처음 접하게 되었습니다. 기본적인 언어들(C, Java, Python 등)을 정말 대학교 수준, 기초들만 익혔고, 더욱 심화 과정들도 살짝만 발을 담가 보았습니다. 그중 Java 언어에 굉장히 관심이 많이 가고, 가장 좋아했습니다.<br>
							저는 인문계 이과를 나왔기 때문에, 대학 초기에는 정보 고등학교를 나온 친구들에게 밀린다고 생각하였고, 그 차이를 줄이고자, 시간을 들여 공부했습니다. 그리고 3학년 다니는 내내 전액 장학금을 받게 되었습니다.<br>
							이렇게 공부를 하다 보니 자연스럽게 자신감도 생기고, 좋아하는 언어도 생겼습니다.<br>
							<br>
							처음으로, 제가 좋아하는 언어가 생겨 아주 기뻤고,<br>
							알면 알수록 복잡하고, 재미있어 더욱더 깊게 따로 공부하게 되었습니다. 처음 1년은 이해하긴 하지만 더욱더 쉽고 빠르게 프로젝트를 진행하고 싶어, 알고리즘 위주로 공부하였고, Jswing, Window Builder 들을 이용해 보기도 하고, 가장 간단한 주위 프로그램들(자판기, 키오스크 등)을 혼자 구축해 보기도 하였습니다.<br>
							그 와중 옛날부터 생각해온 자신만의 홈페이지를 만들고 싶어 했고, 그래서 웹 개발 프로그래밍에 관심을 가지기 시작했습니다.<br>
							웹 개발 프로그래밍에서 유명한 Spring framework에 대해 알게 되었고, MVC 모델에 대해 많은 관심이 갔습니다.<br>
							그래서 MVC 모델과 사용하는 방법에 대해 더 상세하게 알고 싶어 져, 주변 사람들에게도 조언을 구하고,<br>
							인프런 강의들을 듣고 공부하며, 실무적 프로그래밍과 학교에서 가르치는 프로그래밍의 차이를 너무 크게 느끼게 되었고, 더 배울 것이 있다는 것에 좋아했습니다.<br>
							스프링 프레임 워크에 관심을 가지다 보니 여러 개의 스프링 프로젝트를 진행하게 되었고, 그 와중 졸업작품을 스프링으로 구현하게 되었습니다. 만드는 와중 팀장직을 맡게 되었고, 팀원들과 소통의 자리를 자주 가지며, 자신이 생각한 대로 하는 것 보다 서로의 대화를 통해 최고의 결과를 도출해 내려 노력하여 좋게 마무리하게 되었습니다.<br>
							저는 작품에서 MVC 모델 나누는 부분과 매핑, 메인 개발자 역할을 맡았습니다.<br>
							제가 가진 asp 작품들도 스프링으로 다시 바꿔보고, 그렇게 제 부족한 기술력을 보완하고 싶어 공부해왔습니다.<br>
							Mybatis와 Mariadb를 이용하여 현재는 프로젝트를 진행 중입니다.<br>
							점점 더 관심이 생겨 자신이 호스팅을 해보고도 싶어, 카페24에 호스팅을 부탁해, 한 달 정도 운영해본 적이 있고,<br>
							현재는 AWS를 알게 되어 무료 FTP를 이용하고, 스프링 war 파일을 웹 서버에 배포 후, 로그를 보고 고치는 단계 (입문)이지만, 요금 결제로 인한 해지 중입니다.<br>
							인프런 강의로 저 스스로의 계발이 굉장히 중요하다 생각하여, 스프링 프레임워크의 핵심기술에 대하여 공부 중에 있습니다.<br>
							자기 계발을 가장 중요히 여겨, 배우고 싶은 것이 많고, 배우려 하는 의지가 강하며, 습득이 아주 빠릅니다.<br>
							<br>
							길을 가다 보이는 키오스크, 자판기 등에 관심이 생겨 그 구조에 대해 항상 궁금해했습니다.<br>
							대학에 와 순서도라는 과목을 배우며 그 속에서 `아, 이렇게 하면 되겠구나`라고 생각하게 되었고 그 과정이 너무 재밌게 느껴져서 이 진로를 선택하게 되었습니다.<br>
							알면 알수록 복잡한 순서 도를 생각하며 더욱 희열을 느끼고 즐겁다고 생각했습니다. 계속 새로운 것이 추가되고, 알아가며, 자신이 구현할 수 있다고 생각되는 게 너무 즐겁고 행복합니다.<br>
							끊임없는 도전정신으로 맡은 바를 끝까지, 더욱 효율적으로, 완벽하게 수행할 수 있도록 해내고야 마는 저 자신이 동국시스템즈에 입사하여 업무를 전념하는 데 큰 도움이 될 것으로 생각합니다.<br>
							제 열정과 학구열을 동국시스템즈 기업에 바치고 싶습니다.<br>
							<br>
							주변에서 들은 게 많아 입사 후, 바로 도움이 될 수 있도록 계속 공부할 것이며, 회사에 대한 열정을 항상 보여드리며 창의적인 인재가 되고자 합니다.<br>
							또한, 제가 맡은 일은 기한 안에 저 자신이 완벽하게 만족할 수 있도록 할 것이며, 처음에는 피드백을 받아 가겠지만, 후에는 피드백을 주는 처지가 되고자 합니다.<br>
							<br><br>
						</span>
					</div>
				</div>
			</div>
		</section>
	</div>
	
	<!-- Footer -->
	<%@ include file="include/footer.jsp" %>
	
</body>
</html>